app/views/comments/_form.html.erb

SELECT "events".* FROM "events" ORDER BY "events"."name" ASC
---
        <%= form.label :event %>
        <%= form.collection_select(:event_id, Event.all.order(name: :asc), :id, :name, {}, { class: "form-control" }) %>

SELECT "users".* FROM "users" ORDER BY "name" ASC
---
        <%= form.label :user %>
        <%= form.collection_select(:user_id, User.all.order(name: :asc), :id, :username, {}, { class: "form-control" }) %>