app/views/events/_form.html.erb

      <%= form.label :organization %>
      <%= form.collection_select(:organization_id, Organization.all.order(name: :asc), :id, :name, {}, { class: "form-control" }) %>
---
SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."name" ASC

      <%= form.label :user %>
      <%= form.collection_select(:user_id, User.all.order(name: :asc), :id, :username, {}, { class: "form-control" }) %>
---
SELECT "users".* FROM "users" ORDER BY "name" ASC