app/views/events/show.html.erb

<p>
  <% @event.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]

        <%= form.label :user %>
        <%= form.collection_select(:user_id, User.all.order(name: :asc), :id, :username, {}, {class: "form-control"}) %>
---
SELECT "users".* FROM "users" ORDER BY "name" ASC