app/views/events/show.html.erb

          <%= form.label :event %>
          <%= form.collection_select(:event_id, Event.all.order(name: :asc), :id, :name, {}, {class: "form-control"}) %>
---
SELECT "events".* FROM "events" ORDER BY "events"."name" ASC