app/controllers/comments_controller.rb

  def create
    @current_user = current_user
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("message", "user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "Oh no!"], ["user_id", 1], ["event_id", 1], ["created_at", "2020-06-23 04:49:31.894878"], ["updated_at", "2020-06-23 04:49:31.894878"]]

  def current_user
    @current_user = User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]