app/controllers/events_controller.rb

  def show
    @useronevent = UserOnEvent.all
    @current_user = current_user
    @organization = Organization.all
    @comments = Comment.all
    @event_dates_to_votes = DateVote.joins(:event).where("date_votes.event_id = #{params[:id]}")
---
SELECT "date_votes".* FROM "date_votes" INNER JOIN "events" ON "events"."id" = "date_votes"."event_id" WHERE (date_votes.event_id = 1)