app/controllers/events_controller.rb

SELECT "user_on_events".* FROM "user_on_events"
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 3]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def show
    @useronevent = UserOnEvent.all
    @current_user = current_user
    @comments = Comment.all
    @user = User
    @user = User.all

INSERT INTO "events" ("name", "description", "location", "organization_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["location", ""], ["organization_id", 2], ["user_id", 1], ["created_at", "2020-06-05 02:40:07.180163"], ["updated_at", "2020-06-05 02:40:07.180163"]]
---
  def create
    @current_user = current_user
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "starting_event_date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["starting_event_date", nil], ["updated_at", "2020-06-05 01:52:06.342788"], ["id", 1]]
---
  def update
    @current_user = current_user
    respond_to do |format|
      if @event.update(event_params)

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def current_user
    @current_user = User.first