app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations"
---
  def index
    @organizations = Organization.all

SELECT "events".* FROM "events"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def show
    @event = Event.all
    @organizations = Organization.all
    @user = User.all

UPDATE "organizations" SET "description" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["description", "Only for students!"], ["updated_at", "2020-06-04 05:49:02.359476"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @organization.update(organization_params)

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_organization
      @organization = Organization.find(params[:id])