app/controllers/organizations_controller.rb

  def show
    @organization = Organization.where(event_id: params[:event_id], event_private: "public")
    @event = Organization.first.events
    @admin = Admin_org.includes(:user, :admin_org).where(user_id: params[:id])
---
SELECT "users"."id" FROM "users" INNER JOIN "user_on_organizations" ON "users"."id" = "user_on_organizations"."user_id" WHERE "user_on_organizations"."organization_id" = ?  [["organization_id", 1]]