app/controllers/pages_controller.rb

SELECT "events".* FROM "events" WHERE (events.private = 0)
---
  def home
    @events = Event.limit(5)

SELECT "users".* FROM "users" WHERE (lower(username) LIKE '%dd%')
SELECT "organizations".* FROM "organizations" WHERE (lower(name) LIKE '%d%')
SELECT "events".* FROM "events" WHERE (lower(title) or lower(description) LIKE '%d%')
SELECT "events".* FROM "events" INNER JOIN "users" ON "users"."id" = "events"."user_id" WHERE (events.user_id=users.id and lower(users.username) LIKE '%d%')
---
  def search
    if params[:search].blank?
      redirect_to(root_path, alert: "Empty field!") and return
    else
      @parameter = params[:search].downcase

      @results_username = User.all.where("lower(username) LIKE :search", search: "%#{@parameter}%")

      #@results_name = Profile.all.where("lower(name) LIKE :search", search: "%#{@parameter}%")

      @results_organization = Organization.all.where("lower(name) LIKE :search", search: "%#{@parameter}%")

      @results_event = Event.all.where("lower(title) or lower(description) LIKE :search", search: "%#{@parameter}%")

      @results_event_org = Event.joins(user: :organization).where("events.include_organization=1 and users.organization_id=organizations.id and lower(organizations.name) LIKE :search", search: "%#{@parameter}%")