app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def show
    @useronevent = UserOnEvent.all
    @events = Event.all
    @users = User.all
---
SELECT "events".* FROM "events"
SELECT "user_on_events".* FROM "user_on_events"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 22], ["updated_at", "2020-06-04 06:05:04.028798"], ["id", 1]]